app/views/todos/_new_task.html.erb


   <%= f.collection_select :customer_id, Customer.where(user_id: current_user.id ).order("last_name, first_name"), :id, :customer_name, label: 'Asiakas', prompt: true %>
---
SELECT "customers".* FROM "customers" WHERE "customers"."user_id" = ? ORDER BY last_name, first_name  [["user_id", 2]]