app/views/todos/index_by_customer.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
		<br />
    <h3> <%= @todos.first.customer.customer_name %>  </h3>