app/controllers/customers_controller.rb

  def index
    #@customers = Customer.all
    #@customers = Customer.where(user_id: current_user.id, closed: false )
    @customers = Customer.where(user_id: current_user.id ).order("last_name, first_name")
---
SELECT "customers".* FROM "customers" WHERE "customers"."user_id" = ? ORDER BY last_name, first_name  [["user_id", 1]]

   def edit_entry
     @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def create
    puts "Olemme create"
    puts current_user.id
    puts "Olemme create: 2"
    @customer = Customer.new(customer_params)
    @customer.user_id = current_user.id
    puts "Olemme create: 3"
    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("first_name", "last_name", "phone_nbr", "street", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["phone_nbr", ""], ["street", ""], ["city", ""], ["user_id", 1], ["created_at", "2020-03-14 05:37:21.508260"], ["updated_at", "2020-03-14 05:37:21.508260"]]

  def update
    puts "update"
    respond_to do |format|
      if @customer.update(customer_param)
---
UPDATE "customers" SET "phone_nbr" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["phone_nbr", "050-33700177"], ["updated_at", "2020-03-14 08:15:21.148708"], ["id", 16]]