app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."closed" = ?  [["user_id", 1], ["closed", "f"]]
---
  def index
    ##@user = User.find_by_username(params[:user_id])

    @todos = Todo.where(user_id: current_user.id, closed: false )

SELECT  "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."closed" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["closed", "t"], ["LIMIT", 5], ["OFFSET", 0]]
---
  def history
    require 'will_paginate/array'
    ##@user = User.find_by_username(params[:user_id])

    @todos = Todo.where(user_id: current_user.id, closed: true )

    @todos = @todos.paginate(:page => params[:page], :per_page => 5)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit_task
     @todo = Todo.find(params[:id])

INSERT INTO "todos" ("description", "created", "priority", "duedate", "closed", "created_at", "updated_at", "user_id", "customer_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    puts "Olemme create"
    puts current_user.id
    @todo = Todo.new(todo_params)
    @todo.user_id = current_user.id
    @todo.closed = false
    @todo.created = DateTime.now.to_datetime

UPDATE "todos" SET "duedate" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["duedate", "2020-02-12 00:00:00"], ["updated_at", "2020-02-12 21:13:09.266633"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_param)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]
---
  def destroy
    @todo.destroy

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", "2020-02-19 07:11:29.518241"], ["updated_at", "2020-02-19 07:11:29.518799"], ["id", 8]]
---
  def close
    todo = Todo.find(params[:id])
    todo.update_attribute :closed, (not todo.closed)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", nil], ["updated_at", "2020-02-19 07:11:43.663545"], ["id", 8]]
---
  def open
    todo = Todo.find(params[:id])
    todo.update_attribute :closed, (not todo.closed)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_todo
      @todo = Todo.find(params[:id])